     V*=====================================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V*=====================================================================
     V* 04/08/21  003102  BUSFIO Creazione
     V*=====================================================================
     D*  OBIETTIVO
     D*  Programma finalizzato ai test di ottimizzazione di reload:
     D*  SETLL READE su BRARTI0F - Record non trovato
     D*  Programma SPL: 32_SetllAndReadE_2SameKey_NoExist_BRARTI0F
     V*=====================================================================
     H/COPY QILEGEN,£INIZH
      * File
     FBRARTI2L  IF   E           K DISK
      *---------------------------------------------------------------
     D $$NOTFOUND      S              1
      *
     D $TIMST          S               Z   INZ                                   Tempo iniziale
     D $TIMEN          S               Z   INZ                                   Tempo finale
     D $TIMMS          S             10I 0                                       Tempo millisecondi
      *
     D $MSG            S             52                                          Output
      *---------------------------------------------------------------
     I/COPY QILEGEN,£TABB£1DS
     I/COPY QILEGEN,£PDS
      *---------------------------------------------------------------
     D* M A I N
      *---------------------------------------------------------------
      * Begin time
     C                   TIME                    $TIMST
      *
     C     KEY001        KLIST
     C                   KFLD                    A§TIAR
     C                   KFLD                    A§ARTI
      *
     C                   EVAL      A§TIAR='A08'
     C                   EVAL      A§ARTI='ART'
      *
     C     KEY001        SETLL     BRARTI2L
      *
     C     KEY001        READE     BRARTI2L
      *
     C                   IF        A§DEAR = ''
    MU* VAL1($$NOTFOUND) VAL2('1') COMP(EQ)
     C                   EVAL      $$NOTFOUND='1'
     C                   ELSE
    MU* VAL1($$NOTFOUND) VAL2('1') COMP(EQ)
     C                   EVAL      $$NOTFOUND=''
     C                   ENDIF
      * End Time
     C                   TIME                    $TIMEN
      * Elapsed time
     C     $TIMEN        SUBDUR    $TIMST        $TIMMS:*MS
     C                   EVAL      $TIMMS=$TIMMS/1000
      *
     C                   EVAL      $MSG = %CHAR($TIMMS)
     C     $MSG          DSPLY     £PDSNU
      *
     C                   SETON                                        LR
